read_liberty /home/taosimin/iEDA/src/iSTA/examples/example1_fast.lib
read_verilog /home/taosimin/iEDA/src/iSTA/examples/example1.v
link_design top
